           SELECT DEBITOR    ASSIGN TO "GABDEBIT.DAT"
                             ORGANIZATION INDEXED  ACCESS DYNAMIC
                             RECORD KEY DE-KEY
                             ALTERNATE RECORD KEY DE-PKEY DUPLICATES
                             ALTERNATE RECORD KEY DE-MCODE DUPLICATES
                             FILE STATUS WF-STATUS.
