           SELECT STATISTIK  ASSIGN TO "GABISTAT.DAT"
                             ORGANIZATION INDEXED ACCESS DYNAMIC
                             RECORD KEY ST-KEY
                             FILE STATUS IS WF-STATUS.
