           SELECT DEBITOR    ASSIGN TO "GABDEBIT.DAT"
                             ORGANIZATION INDEXED  ACCESS DYNAMIC
                             RECORD KEY DE-KEY
                             ALTERNATE RECORD DE-PKEY DUPLICATES
                             ALTERNATE RECORD DE-MCODE DUPLICATES
                             ALTERNATE RECORD DE-STR DUPLICATES
                             FILE STATUS WF-STATUS.
