           SELECT ANTEXT     ASSIGN TO WH-TXKEY
                             ORGANIZATION RELATIVE, ACCESS DYNAMIC
                             RELATIVE KEY IS WK-TXKEY
                             FILE STATUS WF-STATUS.
